problem-queue-backend/app/api/v1/problems.rb

    resources :problems do
      desc 'returns all problems'
      get '/' do
        @problems = Problem.all
---
SELECT "problems".* FROM "problems"

        requires :id, type: Integer
      end
      get '/:id' do
        @problem = Problem.find(params[:id])
---
SELECT  "problems".* FROM "problems" WHERE "problems"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

          user_id: current_user.id
        )
        puts @problem
        if @problem.save
---
INSERT INTO "problems" ("memo", "priority", "problem_str", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["memo", "水嶋ヒロ"], ["priority", 3], ["problem_str", "abc100_f"], ["user_id", 3], ["created_at", "2020-07-26 14:51:02.040333"], ["updated_at", "2020-07-26 14:51:02.040333"]]