problem-queue-backend/app/api/v1/root.rb

SELECT  "users".* FROM "users" WHERE "users"."token" = $1 LIMIT $2  [["token", "hff2Lpo8AXNhRHykrTw7rCZe"], ["LIMIT", 1]]
---
      def current_user
        return nil unless headers['Authorization'] && headers['Authorization'].match(TOKEN_REGEX)
        token = headers['Authorization'].gsub(TOKEN_PREFIX, '')
        User.find_by(token: token)