problem-queue-backend/app/api/v1/users.rb

SELECT "users".* FROM "users"
---
      # FIXME これいらないかも
      desc 'returns all users'
      get '/' do
        @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        requires :id, type: Integer
      end
      get '/:id' do
        @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "hello@example.com"], ["LIMIT", 1]]
---
        requires :password, type: String
      end
      post '/signin' do
        @user = User.find_by(email: params[:email])

INSERT INTO "users" ("email", "name", "password_digest", "token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
      post '/signup' do
        @user = User.new(declared(params))

        if @user.save